/*
 Localization.strings (English)
 mclient

 Copyright © 2014 - 2018 Christopher Reitz. Licensed under the MIT license.
 See LICENSE file in the project root for full license information.
 */

/* Boards */
"BOARDS" = "BOARDS";
"FAVORITES" = "FAVORITES";
"Verifying login data…" = "Verifying login data…";
"You are not logged in" = "You are not logged in";
"Welcome %@" = "Welcome %@";

/* Search */
"search_title" = "Search";
"search_results_header" = "RESULTS";
"search_all_boards" = "all boards";
"search_phrase" = "Search term";
"search_user" = "Posts from user";
"search_in_subject" = "Search in message texts";
"search_button" = "SEARCH";

/* Responses */
"Replies to your posts" = "Replies to your posts";
"Mark all unread responses as read?" = "Mark all unread responses as read?";
"mark as read" = "mark as read";

/* Notifications */
"Open" = "Open";
"Response from %@:\n%@" = "Response from %@:\n%@";

/* DetailView */
"Favs" = "Favs";
"Boards" = "Boards";
"Threads" = "Threads";
"Select a board…" = "Select a board…";
"Select a thread…" = "Select a thread…";

/* NoData View */
"noDataView_hide_noDataView" = "Hide notice";
"NO FAVORITES" = "NO FAVORITES";
"PLEASE LOGIN TO SEE YOUR FAVORITES" = "PLEASE LOGIN TO SEE YOUR FAVORITES";
"favorites_help_title" = "Add Favorites";
"favorites_help_message" = "To mark a thread as favorite, swipe the entry in the thread list to the right and press the star button.";
"NO RESULTS" = "NO RESULTS";

/* Settings */
"Username" = "Username";
"Password" = "Password";
"Please enter username and password" = "Please enter username and password";
"Error: Could not connect to server" = "Error: Could not connect to server";
"Verifying username and password…" = "Verifying username and password…";
"Login data was entered incorrectly" = "Login data was entered incorrectly";
"Login data is valid" = "Login data is valid";
"Tiny" = "Tiny";
"Small" = "Small";
"Normal" = "Normal";
"Big" = "Big";
"Bigger" = "Bigger";
"Huge" = "Huge";

/* Settings - Font Size */
"Setup Font Size" = "Setup Font Size";
"Reset" = "Reset";

/* Settings - Licenses */
"Licenses" = "Licenses";
"m!client is using the following open-source libraries" = "m!client is using the following open-source libraries";

/* Thread List */
"Mark as read" = "Mark as read";
"Hide thread?" = "Hide thread?";
"Move this thread to your Killfile?" = "Move this thread to your Killfile?";
"Hide thread" = "Hide thread";

/* Message List */
"Copied link" = "Copied link";
"URL for this message was copied to clipboard" = "URL for this message was copied to clipboard";
"Notification enabled" = "Notification enabled";
"You will receive an Email if anyone replies to this message" = "You will receive an Email if anyone replies to this message";
"Notification disabled" = "Notification disabled";
"You will no longer receive Emails if anyone replies to this message" = "You will no longer receive Emails if anyone replies to this message";
"You have been blocked by this user" = "You have been blocked by this user";
"User was blocked by you" = "User wurde von dir blockiert";
"You cannot reply to this post" = "Du kannst auf dieses Posting nicht antworten";

/* Compose Message */
"Create Thread" = "Create Thread";
"Reply" = "Reply";
"Edit" = "Edit";
"Preview" = "Preview";
"Subject" = "Subject:";
"Thank you for your contribution \"%@\"" = "Thank you for your contribution \"%@\"";
"Your message \"%@\" was changed" = "Your message \"%@\" was changed";
"Select quote" = "Select quote";
"Full quote" = "Full quote";

/* Compose Message Toolbar */
"Uploading" = "Uploading";
"camera_access_error_title" = "Unable to access the Camera";
"camera_access_error_message" = "To enable access, go to Settings > Privacy > Camera and turn on Camera access for this app.";
"camera_action_choose_title" = "Add picture";
"camera_action_choose_album" = "Choose existing";
"camera_action_giphy" = "Browse GIFs";
"camera_action_take_photo" = "Take photo";
"image_upload_succeed" = "Succeed";
"image_upload_failed" = "Failed";
"image_upload_error" = "Imgur upload error";

/* MessageTextView */
"B" = "Bold";
"I" = "Italics";
"U" = "Underline";
"S" = "Strikethrough";
"Spoiler" = "Spoiler";
"Link" = "Link";
"Image" = "Image";
"Selected text is not a valid URL" = "Selected text is not a valid URL";
"Selected text is not a valid image URL" = "Selected text is not a valid image URL";

/* Profile */
"picture" = "";
"firstname" = "Firstname";
"lastname" = "Lastname";
"domicile" = "City";
"accountNo" = "Account-No.";
"registrationDate" = "Date of registration";
"email" = "Email";
"icq" = "ICQ";
"homepage" = "Homepage";
"firstGame" = "First Game";
"allTimeClassics" = "All Time Classics";
"favoriteGenres" = "Favorite Genres";
"currentSystems" = "Current Systems";
"hobbies" = "Hobbies";
"xboxLiveGamertag" = "XBox Live Gamertag";
"psnId" = "Playstation Network ID";
"nintendoFriendcode" = "Nintendo Friendcode";
"lastUpdate" = "Last Updated on";

/* Loading View */
"Loading…" = "Loading…";

/* Error View */
"m!service Error" = "m!service error";
"Try pull to refresh…" = "Try pull to refresh…";
"Try again" = "Try again";

/* Keyboard Shortcuts */
"keyboardShortcutDismissDialog" = "Close dialog";
"keyboardShortcutComposeThread" = "New thread";
"keyboardShortcutSelectPreviousThread" = "Load previous thread";
"keyboardShortcutSelectNextThread" = "Load next thread";
"keyboardShortcutSelectPreviousMessage" = "Load previous post";
"keyboardShortcutSelectNextMessage" = "Load next post";
"keyboardShortcutOpenProfile" = "Open user profile";
"keyboardShortcutCopyLink" = "Copy link to post";
"keyboardShortcutComposeEdit" = "Edit post";
"keyboardShortcutComposeReply" = "Reply to post";
"keyboardShortcutGoTo" = "Go to ";

/* Termination */
"header" = "Die Testphase ist beendet\n";
"message" = "Bitte verwende ab sofort die Version aus dem AppStore. Vielen Dank für's fleißige melden von Fehlern und Verbesserungsvorschlägen 👏\n\nDie Entwicklung wird natürlich weiter gehen und größere Änderungen sollen in Zukunft wieder über diesen Channel vorab getestet werden. Sobald es hierzu Neues gibt, wirst du wieder per E-Mail über ein Update der Beta informiert.";
"signature" = "♥️ Stitch\n\n";
"appStoreButton" = "Open AppStore";
"quitButton" = "Quit";

/* Common */
"Error" = "Error";
"No Internet Connection" = "No Internet Connection";
"invalid_web_url" = "%@ is not a valid web URL";
"Confirmation" = "Confirmation";
"Cancel" = "Cancel";
"OK" = "OK";

/* MServiceConnector */
"-2" = "No Internet Connection";
"-1" = "m!service connection failed";
"400" = "Please fill out the subject field";
"401" = "Please verify your login data in settings";
"403" = "Permission denied";
"404" = "Action could not be executed:\n%@";
"406" = "Message was not edited";
"409" = "Editing this message is no longer allowed";
"423" = "This thread is closed";
"500" = "Action could not be executed:\nAn unknown error occured";
"504" = "Man!ac Forum Server down?";
